# pandas

https://www.tutorialspoint.com//python_pandas/index.htm

In [20]:
import pandas as pd
import numpy as np

## series

In [24]:
s = pd.Series(np.random.randn(4))
s

0   -0.316085
1    0.974568
2   -0.331535
3   -0.510385
dtype: float64

## dataframe

In [23]:
d = {
    'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
    'Age':pd.Series([25,26,25,23,30,29,23]),
    'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])
}

df = pd.DataFrame(d)
df

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [26]:
df.T

           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [27]:
df.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['Name', 'Age', 'Rating'], dtype='object')]

In [29]:
df.values

array([['Tom', 25, 4.23],
       ['James', 26, 3.24],
       ['Ricky', 25, 3.98],
       ['Vin', 23, 2.56],
       ['Steve', 30, 3.2],
       ['Smith', 29, 4.6],
       ['Jack', 23, 3.8]], dtype=object)

In [35]:
df.cumsum()

                             Name  Age Rating
0                             Tom   25   4.23
1                        TomJames   51   7.47
2                   TomJamesRicky   76  11.45
3                TomJamesRickyVin   99  14.01
4           TomJamesRickyVinSteve  129  17.21
5      TomJamesRickyVinSteveSmith  158  21.81
6  TomJamesRickyVinSteveSmithJack  181  25.61

## function application

### join

`join` passes the DataFrame (or Series) and the second parameter to
the function specified as the first parameter, returning the
result of the function. the DataFrame/Series object is not modified. `join`s can be chained together.

In [19]:
def adder(a, b):
    print('adder','a=',a,'b=',b)
    return a + b

df = pd.DataFrame(np.random.randn(5,3))
print('df',df)
# pass 'df' and '1' to adder (which just does a matrix add)
print('pipe',df.pipe(adder, 1))
print('df',df)
print(df + 1)  # equivalent

df           0         1         2
0  2.032374  0.245446  1.286700
1  0.653041  2.137156 -0.665096
2  0.334465  1.433793 -0.022725
3  1.420461 -1.411803 -2.403173
4 -1.318539 -0.693364  1.345063
adder a=           0         1         2
0  2.032374  0.245446  1.286700
1  0.653041  2.137156 -0.665096
2  0.334465  1.433793 -0.022725
3  1.420461 -1.411803 -2.403173
4 -1.318539 -0.693364  1.345063 b= 1
pipe           0         1         2
0  3.032374  1.245446  2.286700
1  1.653041  3.137156  0.334904
2  1.334465  2.433793  0.977275
3  2.420461 -0.411803 -1.403173
4 -0.318539  0.306636  2.345063
df           0         1         2
0  2.032374  0.245446  1.286700
1  0.653041  2.137156 -0.665096
2  0.334465  1.433793 -0.022725
3  1.420461 -1.411803 -2.403173
4 -1.318539 -0.693364  1.345063
          0         1         2
0  3.032374  1.245446  2.286700
1  1.653041  3.137156  0.334904
2  1.334465  2.433793  0.977275
3  2.420461 -0.411803 -1.403173
4 -0.318539  0.306636  2.345063
mean 0    0.624360
1    0.342245
2   -0.091846
dtype: float64

### apply

In [30]:
print(df)
print(df.apply(np.sum))
print(df.apply(np.mean))
print(df.apply(np.sum) / 5)

          0         1         2
0  2.032374  0.245446  1.286700
1  0.653041  2.137156 -0.665096
2  0.334465  1.433793 -0.022725
3  1.420461 -1.411803 -2.403173
4 -1.318539 -0.693364  1.345063
0    3.121802
1    1.711227
2   -0.459230
dtype: float64
0    0.624360
1    0.342245
2   -0.091846
dtype: float64
0    0.624360
1    0.342245
2   -0.091846
dtype: float64

In [38]:
df.applymap(lambda x: x + 1)  # element-wise

          0         1         2
0  3.032374  1.245446  2.286700
1  1.653041  3.137156  0.334904
2  1.334465  2.433793  0.977275
3  2.420461 -0.411803 -1.403173
4 -0.318539  0.306636  2.345063

## reindexing

don't quite get the use case here.

In [26]:
N=10

df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})
df

           A    x         y       C           D
0 2016-01-01  0.0  0.797783     Low   93.519787
1 2016-01-02  1.0  0.916929  Medium  108.384496
2 2016-01-03  2.0  0.807199    High  105.859274
3 2016-01-04  3.0  0.671657     Low   91.890410
4 2016-01-05  4.0  0.141392     Low  101.304788
5 2016-01-06  5.0  0.984771     Low  102.133720
6 2016-01-07  6.0  0.581247    High  102.044468
7 2016-01-08  7.0  0.129119  Medium  103.600264
8 2016-01-09  8.0  0.685200    High  100.012490
9 2016-01-10  9.0  0.703836  Medium  121.881168

In [27]:
# take rows 0, 2 and 5 and columns 'A' and 'C' and 'no match'
df.reindex(index=[0,2,5], columns=['A', 'C', 'B'])

           A     C   B
0 2016-01-01   Low NaN
2 2016-01-03  High NaN
5 2016-01-06   Low NaN

In [28]:
df

           A    x         y       C           D
0 2016-01-01  0.0  0.797783     Low   93.519787
1 2016-01-02  1.0  0.916929  Medium  108.384496
2 2016-01-03  2.0  0.807199    High  105.859274
3 2016-01-04  3.0  0.671657     Low   91.890410
4 2016-01-05  4.0  0.141392     Low  101.304788
5 2016-01-06  5.0  0.984771     Low  102.133720
6 2016-01-07  6.0  0.581247    High  102.044468
7 2016-01-08  7.0  0.129119  Medium  103.600264
8 2016-01-09  8.0  0.685200    High  100.012490
9 2016-01-10  9.0  0.703836  Medium  121.881168

In [29]:
df.loc[8, 'D'] = np.NaN

In [30]:
df.reindex(columns=['A', 'D'])

           A           D
0 2016-01-01   93.519787
1 2016-01-02  108.384496
2 2016-01-03  105.859274
3 2016-01-04   91.890410
4 2016-01-05  101.304788
5 2016-01-06  102.133720
6 2016-01-07  102.044468
7 2016-01-08  103.600264
8 2016-01-09         NaN
9 2016-01-10  121.881168

## rename

In [31]:
df.rename(
    columns={'A': 'one', 'D': 'eleven'},
    index={0: 'hey', 2: 'you'}
)

           one    x         y       C      eleven
hey 2016-01-01  0.0  0.797783     Low   93.519787
1   2016-01-02  1.0  0.916929  Medium  108.384496
you 2016-01-03  2.0  0.807199    High  105.859274
3   2016-01-04  3.0  0.671657     Low   91.890410
4   2016-01-05  4.0  0.141392     Low  101.304788
5   2016-01-06  5.0  0.984771     Low  102.133720
6   2016-01-07  6.0  0.581247    High  102.044468
7   2016-01-08  7.0  0.129119  Medium  103.600264
8   2016-01-09  8.0  0.685200    High         NaN
9   2016-01-10  9.0  0.703836  Medium  121.881168

## iteration

In [38]:
N=5

df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})

for col in df:
    print(col)

A
x
y
C
D

In [39]:
for k, v in df.iteritems():
    print('key', k)
    print('value', v)

key A
value 0   2016-01-01
1   2016-01-02
2   2016-01-03
3   2016-01-04
4   2016-01-05
Name: A, dtype: datetime64[ns]
key x
value 0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
Name: x, dtype: float64
key y
value 0    0.450328
1    0.079338
2    0.020662
3    0.688721
4    0.967154
Name: y, dtype: float64
key C
value 0    Medium
1       Low
2    Medium
3      High
4      High
Name: C, dtype: object
key D
value 0    116.023625
1     99.767964
2     85.736999
3     98.152149
4     81.086417
Name: D, dtype: float64

In [40]:
for k,v in df.iterrows():
    print('key', k)
    print('value', v)

key 0
value A    2016-01-01 00:00:00
x                      0
y               0.450328
C                 Medium
D                116.024
Name: 0, dtype: object
key 1
value A    2016-01-02 00:00:00
x                      1
y               0.079338
C                    Low
D                 99.768
Name: 1, dtype: object
key 2
value A    2016-01-03 00:00:00
x                      2
y              0.0206622
C                 Medium
D                 85.737
Name: 2, dtype: object
key 3
value A    2016-01-04 00:00:00
x                      3
y               0.688721
C                   High
D                98.1521
Name: 3, dtype: object
key 4
value A    2016-01-05 00:00:00
x                      4
y               0.967154
C                   High
D                81.0864
Name: 4, dtype: object

In [42]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, A=Timestamp('2016-01-01 00:00:00'), x=0.0, y=0.4503281222201878, C='Medium', D=116.0236253235974)
Pandas(Index=1, A=Timestamp('2016-01-02 00:00:00'), x=1.0, y=0.07933803912537785, C='Low', D=99.76796368865173)
Pandas(Index=2, A=Timestamp('2016-01-03 00:00:00'), x=2.0, y=0.0206621573199961, C='Medium', D=85.7369985624828)
Pandas(Index=3, A=Timestamp('2016-01-04 00:00:00'), x=3.0, y=0.6887209772623125, C='High', D=98.15214898225594)
Pandas(Index=4, A=Timestamp('2016-01-05 00:00:00'), x=4.0, y=0.9671538979395313, C='High', D=81.08641704279287)

## sorting

In [44]:
unsorted_df=pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col2','col1'])
unsorted_df

       col2      col1
1  0.057327  0.692077
4  0.653814 -0.057207
6 -0.095257  1.239168
2 -0.301773 -1.546009
3 -0.624048  1.079112
5 -0.049282 -1.531104
9  0.760711 -0.202651
8  1.018734 -0.023795
0  0.393220  0.337055
7 -0.194327 -0.180463

In [45]:
unsorted_df.sort_index()

       col2      col1
0  0.393220  0.337055
1  0.057327  0.692077
2 -0.301773 -1.546009
3 -0.624048  1.079112
4  0.653814 -0.057207
5 -0.049282 -1.531104
6 -0.095257  1.239168
7 -0.194327 -0.180463
8  1.018734 -0.023795
9  0.760711 -0.202651

In [46]:
unsorted_df.sort_index(ascending=False)

       col2      col1
9  0.760711 -0.202651
8  1.018734 -0.023795
7 -0.194327 -0.180463
6 -0.095257  1.239168
5 -0.049282 -1.531104
4  0.653814 -0.057207
3 -0.624048  1.079112
2 -0.301773 -1.546009
1  0.057327  0.692077
0  0.393220  0.337055

In [47]:
unsorted_df.sort_index(axis=1)

       col1      col2
1  0.692077  0.057327
4 -0.057207  0.653814
6  1.239168 -0.095257
2 -1.546009 -0.301773
3  1.079112 -0.624048
5 -1.531104 -0.049282
9 -0.202651  0.760711
8 -0.023795  1.018734
0  0.337055  0.393220
7 -0.180463 -0.194327

In [48]:
unsorted_df.sort_values(by='col1')

       col2      col1
2 -0.301773 -1.546009
5 -0.049282 -1.531104
9  0.760711 -0.202651
7 -0.194327 -0.180463
4  0.653814 -0.057207
8  1.018734 -0.023795
0  0.393220  0.337055
1  0.057327  0.692077
3 -0.624048  1.079112
6 -0.095257  1.239168

## text data

In [50]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])
s

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [53]:
s.str.lower()

0             tom
1    william rick
2            john
3         alber@t
4             NaN
5            1234
6      stevesmith
dtype: object

In [54]:
s.str.upper()

0             TOM
1    WILLIAM RICK
2            JOHN
3         ALBER@T
4             NaN
5            1234
6      STEVESMITH
dtype: object

In [55]:
s.str.len()

0     3.0
1    12.0
2     4.0
3     7.0
4     NaN
5     4.0
6    10.0
dtype: float64

In [59]:
s.str.cat(sep='--')

'Tom--William Rick--John--Alber@t--1234--SteveSmith'

In [60]:
s.str.get_dummies()

   1234  Alber@t  John  SteveSmith  Tom  William Rick
0     0        0     0           0    1             0
1     0        0     0           0    0             1
2     0        0     1           0    0             0
3     0        1     0           0    0             0
4     0        0     0           0    0             0
5     1        0     0           0    0             0
6     0        0     0           1    0             0

In [63]:
s.str.findall('S')

0        []
1        []
2        []
3        []
4       NaN
5        []
6    [S, S]
dtype: object

# indexing and selecting

In [66]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
a -2.070470 -0.090110 -0.703095  0.150584
b -0.010834  0.898993  0.043341 -1.020433
c  0.247153  0.055812 -1.340061  0.852571
d -2.121297 -0.271258 -1.094285 -0.185284
e -3.430114  1.026755 -1.296093 -0.622998
f  0.828409 -1.049557  0.720981 -1.307702
g  1.313785 -1.039603  0.001899  0.535032
h  1.054987 -1.408160 -0.487320 -0.195269

### loc

Label-based indexing:

df.loc[row `scalar/list/range`, col `scalar/list/range`]

In [69]:
df.loc['a']

A   -2.070470
B   -0.090110
C   -0.703095
D    0.150584
Name: a, dtype: float64

In [71]:
df.loc[:,'A']

a   -2.070470
b   -0.010834
c    0.247153
d   -2.121297
e   -3.430114
f    0.828409
g    1.313785
h    1.054987
Name: A, dtype: float64

In [76]:
df.loc['a','A']

-2.0704698081610986

In [79]:
df.loc['a',['A','B']]

A   -2.07047
B   -0.09011
Name: a, dtype: float64

In [80]:
df.loc[['a','c'],['A','D']]

          A         D
a -2.070470  0.150584
c  0.247153  0.852571

In [83]:
df.loc['c':'g']  # range

          A         B         C         D
c  0.247153  0.055812 -1.340061  0.852571
d -2.121297 -0.271258 -1.094285 -0.185284
e -3.430114  1.026755 -1.296093 -0.622998
f  0.828409 -1.049557  0.720981 -1.307702
g  1.313785 -1.039603  0.001899  0.535032

### iloc

Integer-based indexing:

df.loc[row `scalar/list/range`, col `scalar/list/range`]

In [84]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  1.280489  0.011773 -0.733060  2.036229
1  0.209191  1.746247  1.386860  2.078194
2  0.172466 -1.845272 -0.013397  0.328660
3 -1.374287 -0.697529 -1.399730  0.999163
4  0.107081 -0.421254  0.476895  0.539506
5 -0.933312 -1.059045 -0.887057 -0.148249
6 -2.351214  0.067690  0.290316 -0.072728
7  0.161249  0.794226 -1.003023 -0.794135

In [88]:
df.iloc[4]

A    0.107081
B   -0.421254
C    0.476895
D    0.539506
Name: 4, dtype: float64

In [89]:
df.iloc[[1,3,5],[1,3]]

          B         D
1  1.746247  2.078194
3 -0.697529  0.999163
5 -1.059045 -0.148249

In [90]:
df.iloc[[1,3,5],1:3]

          B         C
1  1.746247  1.386860
3 -0.697529 -1.399730
5 -1.059045 -0.887057

In [93]:
df.iloc[1:3]

          A         B         C         D
1  0.209191  1.746247  1.386860  2.078194
2  0.172466 -1.845272 -0.013397  0.328660

In [94]:
df.iloc[:, 1:3]

          B         C
0  0.011773 -0.733060
1  1.746247  1.386860
2 -1.845272 -0.013397
3 -0.697529 -1.399730
4 -0.421254  0.476895
5 -1.059045 -0.887057
6  0.067690  0.290316
7  0.794226 -1.003023

## statistics

### covariance

In [98]:
s1 = pd.Series(np.random.randn(10))
s2 = pd.Series(np.random.randn(10))
s1.cov(s2)

-0.08402704676632217

In [99]:
df = pd.DataFrame(np.random.randn(10, 5), columns=['a', 'b', 'c', 'd', 'e'])
df['a'].cov(df['b'])

0.2884955572453223

In [100]:
df.cov()

          a         b         c         d         e
a  1.086656  0.288496  0.148353 -0.169150  0.291260
b  0.288496  1.235489 -0.218580  0.170927 -0.705584
c  0.148353 -0.218580  0.846619 -0.008816  0.002881
d -0.169150  0.170927 -0.008816  1.372144 -0.335295
e  0.291260 -0.705584  0.002881 -0.335295  1.419383

In [103]:
df.cov().loc['a','b'] == df.cov().loc['b','a'] == df['a'].cov(df['b'])

True

### correlation

In [104]:
df['a'].corr(df['b'])

0.24898524300599817

In [105]:
df.corr()

          a         b         c         d         e
a  1.000000  0.248985  0.154670 -0.138524  0.234523
b  0.248985  1.000000 -0.213721  0.131278 -0.532819
c  0.154670 -0.213721  1.000000 -0.008179  0.002628
d -0.138524  0.131278 -0.008179  1.000000 -0.240258
e  0.234523 -0.532819  0.002628 -0.240258  1.000000

### ranking

In [107]:
s = pd.Series(np.random.randn(5), index=list('abcde'))
s

a    0.143383
b    1.511781
c   -0.666439
d    0.106036
e   -0.154756
dtype: float64

In [108]:
s.rank()

a    4.0
b    5.0
c    1.0
d    3.0
e    2.0
dtype: float64

## window functions

### rolling

In [111]:
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01 -0.902802 -0.979082 -1.503590  0.696011
2000-01-02 -0.243041  1.447866  0.431893 -0.456837
2000-01-03  1.128397  0.500283  1.622472  0.250341
2000-01-04 -1.668352  0.237492 -1.504595 -0.327103
2000-01-05 -0.776804  0.386824  2.395488 -0.669709
2000-01-06 -0.627680 -0.110899  2.023868 -2.062011
2000-01-07 -0.620385 -0.264261 -0.281044 -0.204415
2000-01-08 -0.311637 -0.081640  0.357749 -0.319226
2000-01-09  1.088113 -0.364826  0.060110  0.733218
2000-01-10 -1.477141 -0.280552  0.129276 -1.103116

In [113]:
df.rolling(window=3).mean()

                   A         B         C         D
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03 -0.005815  0.323022  0.183592  0.163172
2000-01-04 -0.260999  0.728547  0.183257 -0.177866
2000-01-05 -0.438920  0.374866  0.837789 -0.248824
2000-01-06 -1.024279  0.171139  0.971587 -1.019608
2000-01-07 -0.674956  0.003888  1.379437 -0.978712
2000-01-08 -0.519901 -0.152267  0.700191 -0.861884
2000-01-09  0.052030 -0.236909  0.045605  0.069859
2000-01-10 -0.233555 -0.242339  0.182378 -0.229708

In [121]:
df.iloc[:3,0].sum()/3

-0.005815436606686782

In [122]:
df.iloc[1:4,0].sum()/3

-0.26099856774480606

### expanding

In [123]:
df.expanding(min_periods=3).mean()

                   A         B         C         D
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03 -0.005815  0.323022  0.183592  0.163172
2000-01-04 -0.421450  0.301640 -0.238455  0.040603
2000-01-05 -0.492520  0.318677  0.288334 -0.101459
2000-01-06 -0.515047  0.247081  0.577589 -0.428218
2000-01-07 -0.530095  0.174032  0.454927 -0.396246
2000-01-08 -0.502788  0.142073  0.442780 -0.386619
2000-01-09 -0.326021  0.085751  0.400261 -0.262192
2000-01-10 -0.441133  0.049121  0.373163 -0.346285

In [124]:
df.iloc[:4,0].sum()/4

-0.42144950033741657

In [125]:
df.iloc[:5,0].sum()/5

-0.49252036419275036

### ewm

not sure what this one does...

In [126]:
df.ewm(com=0.5).mean()

                   A         B         C         D
2000-01-01 -0.902802 -0.979082 -1.503590  0.696011
2000-01-02 -0.407981  0.841129 -0.051978 -0.168625
2000-01-03  0.655665  0.605158  1.107257  0.121429
2000-01-04 -0.913046  0.356984 -0.655743 -0.181331
2000-01-05 -0.821843  0.376960  1.386817 -0.508262
2000-01-06 -0.692223  0.051274  1.812101 -1.545517
2000-01-07 -0.644309 -0.159179  0.416032 -0.651040
2000-01-08 -0.422494 -0.107478  0.377171 -0.429797
2000-01-09  0.584628 -0.279052  0.165786  0.345586
2000-01-10 -0.789908 -0.280052  0.141446 -0.620232

## aggregation

In [130]:
r = df.rolling(window=3, min_periods=1)
r

Rolling [window=3,min_periods=1,center=False,axis=0]

In [131]:
r.aggregate(np.sum)

                   A         B         C         D
2000-01-01 -0.902802 -0.979082 -1.503590  0.696011
2000-01-02 -1.145843  0.468784 -1.071698  0.239174
2000-01-03 -0.017446  0.969067  0.550775  0.489515
2000-01-04 -0.782996  2.185641  0.549770 -0.533599
2000-01-05 -1.316759  1.124599  2.513366 -0.746471
2000-01-06 -3.072836  0.513417  2.914761 -3.058823
2000-01-07 -2.024869  0.011664  4.138312 -2.936135
2000-01-08 -1.559702 -0.456800  2.100573 -2.585652
2000-01-09  0.156090 -0.710727  0.136815  0.209577
2000-01-10 -0.700665 -0.727017  0.547135 -0.689124

In [136]:
sum(df.iloc[:2, 0])

-1.1458432634209903

In [137]:
sum(df.iloc[:3, 0])

-0.017446309820060346

In [140]:
r[['A','B']].aggregate(np.sum)

                   A         B
2000-01-01 -0.902802 -0.979082
2000-01-02 -1.145843  0.468784
2000-01-03 -0.017446  0.969067
2000-01-04 -0.782996  2.185641
2000-01-05 -1.316759  1.124599
2000-01-06 -3.072836  0.513417
2000-01-07 -2.024869  0.011664
2000-01-08 -1.559702 -0.456800
2000-01-09  0.156090 -0.710727
2000-01-10 -0.700665 -0.727017

In [144]:
r['A'].aggregate([np.sum, np.mean])

                 sum      mean
2000-01-01 -0.902802 -0.902802
2000-01-02 -1.145843 -0.572922
2000-01-03 -0.017446 -0.005815
2000-01-04 -0.782996 -0.260999
2000-01-05 -1.316759 -0.438920
2000-01-06 -3.072836 -1.024279
2000-01-07 -2.024869 -0.674956
2000-01-08 -1.559702 -0.519901
2000-01-09  0.156090  0.052030
2000-01-10 -0.700665 -0.233555

In [145]:
r[['A','B']].aggregate([np.sum, np.mean])

                   A                   B
                 sum      mean       sum      mean
2000-01-01 -0.902802 -0.902802 -0.979082 -0.979082
2000-01-02 -1.145843 -0.572922  0.468784  0.234392
2000-01-03 -0.017446 -0.005815  0.969067  0.323022
2000-01-04 -0.782996 -0.260999  2.185641  0.728547
2000-01-05 -1.316759 -0.438920  1.124599  0.374866
2000-01-06 -3.072836 -1.024279  0.513417  0.171139
2000-01-07 -2.024869 -0.674956  0.011664  0.003888
2000-01-08 -1.559702 -0.519901 -0.456800 -0.152267
2000-01-09  0.156090  0.052030 -0.710727 -0.236909
2000-01-10 -0.700665 -0.233555 -0.727017 -0.242339

In [146]:
r.aggregate({'A': np.sum, 'B': np.mean})

                   A         B
2000-01-01 -0.902802 -0.979082
2000-01-02 -1.145843  0.234392
2000-01-03 -0.017446  0.323022
2000-01-04 -0.782996  0.728547
2000-01-05 -1.316759  0.374866
2000-01-06 -3.072836  0.171139
2000-01-07 -2.024869  0.003888
2000-01-08 -1.559702 -0.152267
2000-01-09  0.156090 -0.236909
2000-01-10 -0.700665 -0.242339

## missing data

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

        one       two     three
a -0.671757 -1.069909 -0.006395
b       NaN       NaN       NaN
c -0.877834 -0.055610 -0.964804
d       NaN       NaN       NaN
e -0.083884 -1.443086 -0.485629
f -0.509289 -0.138532  0.008620
g       NaN       NaN       NaN
h  0.998139 -0.196010  0.908409

In [4]:
df.isnull()  # or notnull()

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False

In [9]:
    df['one'].sum()

-1.144624360179968

In [10]:
df.fillna(0)

        one       two     three
a -0.671757 -1.069909 -0.006395
b  0.000000  0.000000  0.000000
c -0.877834 -0.055610 -0.964804
d  0.000000  0.000000  0.000000
e -0.083884 -1.443086 -0.485629
f -0.509289 -0.138532  0.008620
g  0.000000  0.000000  0.000000
h  0.998139 -0.196010  0.908409

In [13]:
df.fillna(method='pad')  # or 'backfill' for reverse pad

        one       two     three
a -0.671757 -1.069909 -0.006395
b -0.671757 -1.069909 -0.006395
c -0.877834 -0.055610 -0.964804
d -0.877834 -0.055610 -0.964804
e -0.083884 -1.443086 -0.485629
f -0.509289 -0.138532  0.008620
g -0.509289 -0.138532  0.008620
h  0.998139 -0.196010  0.908409

In [14]:
df.dropna()

        one       two     three
a -0.671757 -1.069909 -0.006395
c -0.877834 -0.055610 -0.964804
e -0.083884 -1.443086 -0.485629
f -0.509289 -0.138532  0.008620
h  0.998139 -0.196010  0.908409

In [19]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
df.replace({0: 123})

    one   two
0    10  1000
1    20   123
2    30    30
3    40    40
4    50    50
5  2000    60

## groupby

In [21]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [23]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [26]:
df.groupby(['Team', 'Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

In [27]:
for name, group in df.groupby('Year'):
    print(name)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [32]:
df.groupby('Year').get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

### aggregation

In [41]:
df.groupby('Year')['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [43]:
df.groupby('Team').agg(np.size)

        Rank  Year  Points
Team
Devils     2     2       2
Kings      3     3       3
Riders     4     4       4
Royals     2     2       2
kings      1     1       1

In [46]:
df.groupby('Team')['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

### transformation

not sure about what is happening here...

In [53]:
score = lambda x: (x - x.mean()) / x.std() * 10
df.groupby('Team').transform(score)

         Rank       Year     Points
0  -15.000000 -11.618950  12.843272
1    5.000000  -3.872983   3.020286
2   -7.071068  -7.071068   7.071068
3    7.071068   7.071068  -7.071068
4   11.547005 -10.910895  -8.608621
5         NaN        NaN        NaN
6   -5.773503   2.182179  -2.360428
7   -5.773503   8.728716  10.969049
8    5.000000   3.872983  -7.705963
9    7.071068  -7.071068  -7.071068
10  -7.071068   7.071068   7.071068
11   5.000000  11.618950  -8.157595

### filtration

In [54]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

## dates

In [57]:
pd.date_range('2019-10-01', periods=5, freq='D')

DatetimeIndex(['2019-10-01', '2019-10-02', '2019-10-03', '2019-10-04',
               '2019-10-05'],
              dtype='datetime64[ns]', freq='D')

## timedelta

In [61]:
pd.Timedelta(days=1)

Timedelta('1 days 00:00:00')